src/DataProcessors/СозданиеБарКодовНаБухты/СозданиеБарКодовНаБухты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданиеБарКодовНаБухты</name>
  <attributes>
    <name>ПоступлениеМПЗ</name>
    <type>
      <types>DocumentRef.ПоступлениеМПЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/НормыРасходов/НормыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.АналогиНормРасходов</types>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/БарКоды/БарКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БарКоды</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтарыйБарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>MAC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IMEI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодDanfoss</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерийныйНомерEnLogic</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IDКлюча</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>BT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерИзделия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/НумераторБарКодов/НумераторБарКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НумераторБарКодов</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СледующийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСброса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/СозданиеБарКодовНаБухты/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.ПоступлениеМПЗ = ЭтаФорма.Параметры.ПоступлениеМПЗ; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьНоменклатуруНаСервере()
Запрос = Новый Запрос;

ТаблицаНоменклатуры.Очистить();
	Для каждого ТЧ Из Объект.ПоступлениеМПЗ.ТабличнаяЧасть Цикл
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НормыРасходов.Владелец КАК Владелец
		|ИЗ
		|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
		|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
		|ГДЕ
		|	НормыРасходов.ПометкаУдаления = ЛОЖЬ
		|	И НормыРасходов.Владелец.Родитель = &ВладелецРодитель
		|	И НормыРасходов.Элемент = &Элемент
		|	И НормыРасходовСрезПоследних.Норма > 0";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("ВладелецРодитель", Объект.ГруппаНоменклатуры);
	Запрос.УстановитьПараметр("Элемент", ТЧ.МПЗ);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаНР = РезультатЗапроса.Выбрать();
		Пока ВыборкаНР.Следующий() Цикл
		Выборка = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("Номенклатура",ВыборкаНР.Владелец));
			Если Выборка.Количество() = 0 Тогда
			ТЧ = ТаблицаНоменклатуры.Добавить();
			ТЧ.Пометка = Истина;
			ТЧ.Номенклатура = ВыборкаНР.Владелец;
			ТЧ.Количество = 1;
			КонецЕсли; 
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНоменклатуру(Команда)
	Если Не Объект.ГруппаНоменклатуры.Пустая() Тогда
	ПолучитьНоменклатуруНаСервере();
	Иначе
	Сообщить("Выберите группу номенклатуры для поиска!");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БарКодСоздан(Изделие,НомерИзделия)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	БарКоды.ПЗ КАК ПЗ
	|ИЗ
	|	РегистрСведений.БарКоды КАК БарКоды
	|ГДЕ
	|	БарКоды.ПЗ = &Документ
	|	И БарКоды.Изделие = &Изделие
	|	И БарКоды.НомерИзделия = &НомерИзделия";
Запрос.УстановитьПараметр("Документ", Объект.ПоступлениеМПЗ);
Запрос.УстановитьПараметр("Изделие", Изделие);
Запрос.УстановитьПараметр("НомерИзделия", НомерИзделия);
РезультатЗапроса = Запрос.Выполнить();
Возврат(Не РезультатЗапроса.Пустой());
КонецФункции 

&НаСервере
Процедура СоздатьБарКодыНаСервере()
	Если Не Объект.Подразделение.Пустая() Тогда
	Н = Справочники.НумераторБарКодов.НайтиПоРеквизиту("Подразделение",Объект.Подразделение);
		Если Не Н.Пустая() Тогда
		Период = ТекущаяДата();
			Если КонецДня(Н.ДатаСброса) < КонецДня(ТекущаяДата()) Тогда
			Нумератор = Н.ПолучитьОбъект();
			Нумератор.СледующийНомер = 1;
			Нумератор.ДатаСброса = КонецГода(ТекущаяДата());
			Нумератор.Записать();					
			КонецЕсли;
				Для каждого ТЧ Из ТаблицаНоменклатуры Цикл	
					Если ТЧ.Пометка Тогда 
					Изделие = ТЧ.Номенклатура;
						Для к = 1 По ТЧ.Количество Цикл
							Если Не Изделие.Товар.Пустая() Тогда
								Если Не БарКодСоздан(Изделие,к) Тогда
								БарКод = РегистрыСведений.БарКоды.СоздатьМенеджерЗаписи();
								БарКод.Период = Период;
								БарКод.ПЗ = Объект.ПоступлениеМПЗ;
								БарКод.Товар = Изделие.Товар;
								БарКод.Изделие = Изделие;
								БарКод.НомерИзделия = к;
								БарКод.БарКод = ОбщийМодульВызовСервера.ПолучитьАртикулПоКодуТовара(Изделие.Товар.Код)+Сред(Год(Период),4)+Формат(Месяц(Период),"ЧЦ=2; ЧВН=")+Объект.Подразделение.Код+Формат(Н.СледующийНомер,"ЧЦ=6; ЧВН=; ЧГ=");
								БарКод.Записать(Ложь);
								Нумератор = Н.ПолучитьОбъект();
								Нумератор.СледующийНомер = Нумератор.СледующийНомер+1;
								Нумератор.Записать();
								Иначе
								Сообщить(СокрЛП(Изделие.Наименование)+" - бар-код уже создан!");
								КонецЕсли;
							Иначе
							Сообщить(СокрЛП(Изделие.Наименование)+" - изделию не присвоен Товар!");
							КонецЕсли;												
						КонецЦикла;
					КонецЕсли; 
				КонецЦикла;
		Иначе
		Сообщить("Не создан нумератор бар-кодов для подразделения!");
		КонецЕсли;
	Иначе
	Сообщить("Выберите подразделение!");
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБарКоды(Команда)
СоздатьБарКодыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
ОткрытьФорму("Обработка.СозданныеБарКоды.Форма.Форма",Новый Структура("ПоступлениеМПЗ,КоличествоКопий",Объект.ПоступлениеМПЗ,2));
КонецПроцедуры
